---
kind: property
id: P:Autodesk.Revit.DB.Viewport.SheetId
source: html/187ece0f-f732-ec3c-1f20-ad688b8c1499.htm
---
# Autodesk.Revit.DB.Viewport.SheetId Property

The element id of the ViewSheet on which the viewport appears,
 or InvalidElementId if this viewport does not associate a view
 with placement onto a sheet.

## Syntax (C#)
```csharp
public ElementId SheetId { get; }
```